[{
    "title": "Accounts Payable Lead",
    "description": "The USG System Office of Human Resources is accepting applications for an Accounts Payable Lead in the Office of Fiscal Affairs. For this position, an advanced level of knowledge is required in general accounting, performing analysis and understanding the state surplus process.  Solid working knowledge is necessary in mathematics, quality assurance/control, auditing, cash management, chart of accounts maintenance, data analysis, data compilation, data entry, and preparation of management reports.  This position requires interpersonal communication skills such as exchanging information and troubleshooting issues; and preparing written communications such as emails, memoranda and letters.  This position requires operating and maintaining standard office equipment.  This position requires computer knowledge to search computer files, generate standard reports, create and edit information on spreadsheets or via programs and ensure data integrity.  Candidate must be able to work independently in a fast-paced environment while managing multiple tasks and have excellent organizational skills.",
    "department": "Department: USO-VC Fiscal Affairs 9801715000",
    "location": "Location: Atlanta"
}, {
    "title": "Acquisitions and Electronic Resources Coordinator",
    "description": "The USG is now accepting applications for an Acquisitions and Electronic Resources Coordinator for GALILEO. GALILEO supports the University System of Georgia libraries and other libraries in Georgia in collaborative efforts to provide high quality services to students, faculty, staff, and citizens.The Acquisitions and Electronic Resources Coordinator provides leadership for materials acquisition and electronic resources licensing for the GALILEO service and the University System of Georgia libraries. The Coordinator has primary responsibility for licensing, acquiring, and initiating electronic resources workflows. The incumbent works closely with subject librarians and staff across the GALILEO community to support data-driven, innovative strategies to leverage the GALILEO budget and enhance the digital library infrastructure to provide scholarly research and other content for the GALILEO community. The Coordinator reports to the Executive Director for GALILEO and works closely with GALILEO staff in planning, recommending, acquiring, evaluating, and reporting, as related to the provision of a variety of services for GALILEO and other special projects.  This individual participates in the overall GALILEO management team and consults and collaborates with project teams, institutional partners, and other entities to recommend and implement solutions to service needs.GALILEO is a complex and growing service. The type of projects and related services will vary and may be significant in scope. Activities and decisions of the Acquisitions and Electronic Resources Coordinator are varied in nature, requiring independent action and judgment in solving common problems, subject to system-wide policies and procedures.",
    "department": "Department: USO - GALILEO 9801581000",
    "location": "Location: Athens"
}, {
    "title": "Business Systems Analyst, Advanced Entry - Payroll",
    "description": "The USG is accepting applications for an advanced entry level HCM support position within the USG's Information Technology Services. This advanced entry level position is responsible for assisting with analysis of business problems and assessing how information systems can be utilized to address them. The position assists in the collection and analysis of data and helps provide quality analytics to researchers and decision makers within the higher education system in support of business/data solutions.**Please Note:  This position is based in Athens with the potential to be located in Sandersville under approved circumstances.**",
    "department": "Department: USO-HCM Project Implementation 9807311100",
    "location": "Location: Athens"
}, {
    "title": "Business Systems Analyst, Advanced Entry - PeopleSoft Security/Workflow Analyst",
    "description": "The USG is accepting applications for an advanced entry level HCM support position within the USG's Information Technology Services. This advanced entry level position is responsible for assisting with analysis of business problems and assessing how information systems can be utilized to address them. The position assists in the collection and analysis of data and helps provide quality analytics to researchers and decision makers within the higher education system in support of business/data solutions.",
    "department": "Department: USO-HCM Project Implementation 9807311100",
    "location": "Location: Athens"
}, {
    "title": "Business Systems Analyst, Advanced Entry - Time and Absence",
    "description": "The USG is accepting applications for an advanced entry level HCM support position within the USG's Information Technology Services. This advanced entry level position is responsible for assisting with analysis of business problems and assessing how information systems can be utilized to address them. The position assists in the collection and analysis of data and helps provide quality analytics to researchers and decision makers within the higher education system in support of business/data solutions.**Please Note:  This position is based in Athens with the potential to be located in Sandersville under approved circumstances.**",
    "department": "Department: USO-HCM Project Implementation 9807311100",
    "location": "Location: Athens"
}, {
    "title": "Business Systems Analyst, Senior",
    "description": "The USG System Office's Information Technology Services (ITS) is accepting applications for a Business Systems Analyst, Senior. This is a senior professional level position responsible for the analysis of complex business problems and assessing how information systems can be utilized to address them. The position performs the collection and analysis of data and provides quality analytics to researchers and decision makers within the higher education system in support of business/data solutions. The position generally possesses authority to coordinate work of the \"Business Systems Analyst\" and \"Business Systems Analyst Entry Level\" positions and instruct the \"Business Systems Analyst\" and \"Business Systems Analyst Entry Level\" positions in specific techniques or technical methods for accomplishing work assignments or projects. The position may serve as project leader on special projects.",
    "department": "Department: USO-Student Services 9807313000",
    "location": "Location: Athens"
}, {
    "title": "Business Systems Analyst, Senior - Human Resources and Faculty Events",
    "description": "The University System Office of the USG (USO) is accepting applications for a senior level HCM support position within the USO's Information Technology Services. This is a senior professional level position responsible for the analysis of complex business problems and assessing how information systems can be utilized to address them. This position effectively documents and supports the structure and functions of extremely complex administrative applications and services for other managers and institutional personnel to insure that the systems continue to operate smoothly even while modifications and enhancements are being made.",
    "department": "Department: USO-HCM Project Implementation 9807311100",
    "location": "Location: Athens"
}, {
    "title": "Coordinator of P3 Financial Operations",
    "description": "The USG is accepting applications for the Coordinator of P3 Financial Operations for the Office of Fiscal Affairs. The Coordinator of P3 Financial Operations is responsible for coordinating all P3 financial transactions under terms of the operating agreements. Under the leadership of the P3 Portfolio Manager, this individual will be the primary liaison with the accounting professionals at the participating campuses, with the BOR accounting staff, and with the Concessionaire.  This position requires significant coordination with multiple campuses and the Concessionaire, strong attention to detail, problem solving, and collaborative process improvement.",
    "department": "Department: USO-Public-Private Initiatives 9801719000",
    "location": "Location: Atlanta"
}, {
    "title": "Director of Information Technology (IT) Audit",
    "description": "The Director will interact with Institution Presidents, Chief Business Officers, Vice Chancellors, VPAAs, CIOs, Regents, the Board of Regents Committee for Internal Audit, Risk and Compliance, and senior management at all institutions. The director is the main interface to various USG organizational groups including the USG CIO Committee, the Security Advisory Group, Audit, the Risk Management Committee and coordination with the with various law enforcement agencies and the State of Georgia Chief Information Security Officer.As part of the background check process, this position WILL require a satisfactory Consumer Credit check (http://www.usg.edu/hr/manual/background_investigation) and Motor Vehicle Report (MVR) (http://www.usg.edu/hr/manual/motor_vehicle_use) as a condition of employment. Salary is commensurate with education and experience.",
    "department": "Department: USO-Internal Auditing Services 9801400000",
    "location": "Location: Atlanta"
}, {
    "title": "Education Specialist",
    "description": "The USG is now accepting applications for an Education Specialist with the Georgia Archives and Records Center. The Georgia Archives identifies, collects, provides access and preserves Georgia’s historical documents and the Records Center provides cost-effective storage of records that are awaiting their destruction date, thereby reducing state costs.The Education Specialist works closely with Archives staff and with schools, colleges, universities, and education related groups throughout Georgia. This position is highly visible with influence on the direction of the education and outreach programs of the Georgia Archives and requires the ability to think strategically and show innovative, extensive knowledge of education principles and the ability to work well with colleagues, government employees, elected officials, and students. ",
    "department": "Department: USO-State Archives/Records Center 9801750000",
    "location": "Location: State Archives"
}, {
    "title": "Executive Director for Organizational Development",
    "description": "The USG System Office of Human Resources is accepting applications for an Executive Director for Organizational Development. The Executive Director for Organizational Development has responsibility for the implementation and delivery of effective HR strategies and plans in the areas of Human Resources Development, human capital management operations and employee relations efforts.  The Executive Director for Organizational Development will provide oversight to deliver human resources operational efficiency across the University System of Georgia. The position will partner with human resources leaders across the system to ensure that HR provides efficient and effective services that support the ongoing needs of the university system and actively foster a culture consistent with the university’s values and establishes expectations to ensure the function is resourced to deliver best-in-class HR service levels across the university.",
    "department": "Department: USO-Human Resources 9801713100",
    "location": "Location: Atlanta"
}, {
    "title": "Film Production Training Instructor",
    "description": "The Georgia Film Academy (GFA) is a collaborative effort of the University System of Georgia and the Technical College System of Georgia. GFA will address the workforce needs of the growing Film and TV Production Industry. Our mandate is to create training programs for Georgians, prepare workers for entry-level positions on the sets of Film and TV productions, and help integrate qualified students into the film production workforce. In order to accomplish this task, the GFA is developing a pool of qualified instructors to teach classes at our four-year and two-year institutions, as well as industry partnership locations. The GFA will provide specific course outline/structure, materials, training, and mentoring.  The classes will be facilitated with a package of professional-level equipment and taught in an appropriate classroom and demonstration space.       Please visit www.georgiafilmacademy.org for information and insights about the GFA Program.  Apply via the University System of Georgia career portal at http://www.usg.edu/hr/jobs/.\r\n                                                                                                                                                                                                                                ",
    "department": "Department: USO - Georgia Film Academy 9801521000",
    "location": "Location: Atlanta"
}, {
    "title": "Intern/Graduate Student Assistant",
    "description": "",
    "department": "Department: USO-Internal Auditing Services 9801400000",
    "location": "Location: Atlanta"
}, {
    "title": "SSC Customer Service Manager",
    "description": "",
    "department": "Department: USO-Shared Services Center (9805002000)",
    "location": "Location: Sandersville"
}, {
    "title": "SSC Project Manager II",
    "description": "",
    "department": "Department: USO-Shared Services Center (9805002000)",
    "location": "Location: Sandersville"
}, {
    "title": "Student Assistant",
    "description": "",
    "department": "Department: USO-Data Services 9807334000",
    "location": "Location: Athens"
}, {
    "title": "Student Assistant",
    "description": "",
    "department": "Department: USO-Software Resource Services 9807118000",
    "location": "Location: Athens"
}, {
    "title": "Student Assistant",
    "description": " ",
    "department": "Department: USO-Human Resources 9801713100",
    "location": "Location: Atlanta"
}, {
    "title": "Student Assistant",
    "description": "",
    "department": "Department: USO-Georgia Public Library Service 9809010000",
    "location": "Location: State Archives"
}, {
    "title": "Student Assistant",
    "description": "",
    "department": "Department: USO-Office of Legal Affairs 9801718000",
    "location": "Location: Atlanta"
}, {
    "title": "Student Assistant for Office of Fiscal Affairs",
    "description": "",
    "department": "Department: USO-VC Fiscal Affairs 9801715000",
    "location": "Location: Atlanta"
}, {
    "title": "Student Assistant for Office of Real Estate and Facilities",
    "description": " ",
    "department": "Department: USO-Facilities Program Mgmt 9801711000",
    "location": "Location: Atlanta"
}, {
    "title": "Systems Analyst Senior",
    "description": "The USG System Office's Information Technology Services (ITS) is accepting applications for a Systems Analyst, Senior.  This position is a senior professional level position responsible for analyzing complex systems hardware and software problems and developing complex technical solutions. This position incorporates both user and systems requirements into functional technical specifications. The position works closely with both developers and end users to ensure adherence to technical specifications and satisfaction with results. This position generally possesses authority to coordinate work of \"Systems Analyst\" and \" Systems Analyst Entry Level\" positions and instructs \"Systems Analyst\" and \"Systems Analyst Entry Level\" positions in specific techniques or technical methods for accomplishing work assignments or projects. This position serves as project leader on special projects.",
    "department": "Department: USO-Student Services 9807313000",
    "location": "Location: Athens"
}, {
    "title": "Systems Analyst, Senior",
    "description": "The USG is accepting applications for a senior level position in the USG's Information Technology Services (ITS) department to be part of the implementation team for PeopleSoft HCM. This is a senior professional level position responsible for analyzing complex systems hardware and software problems and developing complex technical solutions. This position incorporates both user and systems requirements into technical specifications. The position works closely with a team of developers and functional experts to ensure adherence to technical specifications and satisfaction with results. This position will coordinate work of team members on assigned aspects of the implementation project. This position may serve as project leader on special projects.",
    "department": "Department: USO-HCM Project Implementation 9807311100",
    "location": "Location: Athens"
}, {
    "title": "Systems Analyst, Working Level",
    "description": "The USG is accepting applications for a working level position in the USG's Information Technology Services (ITS) department to be part of the implementation team for the PeopleSoft HCM. This is a professional position responsible for analyzing systems hardware and software problems of varying complexity and developing technical solutions of varying complexity. This position incorporates both user and systems requirements into technical specifications. The position works closely with a team of developers and functional experts to ensure adherence to technical specifications and satisfaction with results.",
    "department": "Department: USO-HCM Project Implementation 9807311100",
    "location": "Location: Athens"
}]
